#!/bin/bash 
clear

DARK_YELLOW='\033[0;33m'
BLUE='\033[0;34m'
RED='\033[0;31m'
GREEN='\033[0;32m'
NC='\033[0m'

echo -e "${GREEN}"

cat << "BANNER"

 ██████   █████                                     █████ █████
░░██████ ░░███                                     ░░███ ░░███ 
 ░███░███ ░███  █████████████    ██████   ████████  ░░███ ███  
 ░███░░███░███ ░░███░░███░░███  ░░░░░███ ░░███░░███  ░░█████   
 ░███ ░░██████  ░███ ░███ ░███   ███████  ░███ ░███   ███░███  
 ░███  ░░█████  ░███ ░███ ░███  ███░░███  ░███ ░███  ███ ░░███ 
 █████  ░░█████ █████░███ █████░░████████ ░███████  █████ █████
░░░░░    ░░░░░ ░░░░░ ░░░ ░░░░░  ░░░░░░░░  ░███░░░  ░░░░░ ░░░░░ 
                                          ░███                 
                                          █████                
                                         ░░░░░                 

BANNER

echo -e "${NC}"






read -p  "[+] do you want to do any scans (yes/no) :"  yes

if [[ "$yes" == "yes" || "$yes" == "y" || "$yes" == "YES"  ]]

then

read -p  "[+] enter your target ip address (ex:8.8.8.8) :" scan 

echo -e "${GREEN}"

if command -v nmap &> /dev/null


then

    echo "[+] Nmap already installed."

else

    echo "[-] Nmap not found."

    echo "[+] Installing Nmap..."

    sudo apt update

    sudo apt install nmap -y

fi

echo -e "${NC}"


echo "[+] creating folder ...."

mkdir $scan

echo "[+] chancing the dir ...."

cd $scan

echo "========================================="
echo        "Starting nmap scanner......"  
echo "========================================="

echo -e "${BLUE}"
echo "++++++++++++++++++++++++++++++++++++++++++++++++++++++++"
echo "nmap normal scan.............. "
echo "+++++++++++++++++++++++++++++++++++++++++++++++++++++++++"

nmap $scan -oN normalscan.txt

echo "---------------------------------------------------------------------------------------------------------------------------------------------"

echo -e "${RED}"
echo "++++++++++++++++++++++++++++++++++++++++++++++++++++++++"
echo "nmap versions finding scan.......... "
echo "++++++++++++++++++++++++++++++++++++++++++++++++++++++++"

nmap -sV $scan -oN versionscan.txt

echo "---------------------------------------------------------------------------------------------------------------------------------------------"

echo -e "${DARK_YELLOW}"
echo "++++++++++++++++++++++++++++++++++++++++++++++++++++++++"
echo "nmap basic script scan..............."
echo "++++++++++++++++++++++++++++++++++++++++++++++++++++++++"

nmap -sC $scan -oN scriptscan.txt

echo "---------------------------------------------------------------------------------------------------------------------------------------------"

else 

echo -e "${NC}"

echo "okay buddy you not want to scan !!!"

echo "bye...."

fi

echo -e "${NC}"
